app/views/users/index.html.erb

                <td><%= user.beers.size %></td>
                <td><%= user.ratings.size %></td>
---
SELECT COUNT(*) FROM "ratings"  WHERE "ratings"."user_id" = ?  [["user_id", 1]]