app/views/ratings/index.html.erb

SELECT "ratings".* FROM "ratings"
SELECT COUNT(*) FROM "ratings"
---
                        end%></td>
                <td><%= rater.ratings.count %></td>