app/views/ratings/new.html.erb

SELECT "beers".* FROM "beers"
---
<%= form_for(@rating) do |f| %>
  <%= f.select :beer_id, options_from_collection_for_select(@beers, :id, :to_s, @rating.beer_id) %>