app/controllers/beers_controller.rb

  def index
    @beers = Beer.includes(:brewery, :style).all
---
SELECT "beers".* FROM "beers"

  def edit
    @breweries = Brewery.all
---
SELECT "breweries".* FROM "breweries"

  def create
    expire_beer_fragments
    @beer = Beer.new(beer_params)

    respond_to do |format|
      if @beer.save
---
INSERT INTO "beers" ("brewery_id", "created_at", "name", "style_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["brewery_id", 1], ["created_at", "2015-02-21 21:57:06.268917"], ["name", "Koff III"], ["style_id", 1], ["updated_at", "2015-02-21 21:57:06.268917"]]