app/controllers/breweries_controller.rb

  def create
    expire_brewery_fragments
    @brewery = Brewery.new(brewery_params)

    respond_to do |format|
      if @brewery.save
---
INSERT INTO "breweries" ("created_at", "name", "updated_at", "year") VALUES (?, ?, ?, ?)  [["created_at", "2015-02-22 15:39:12.344470"], ["name", "Kalja mesta"], ["updated_at", "2015-02-22 15:39:12.344470"], ["year", 1666]]

  def update
    expire_brewery_fragments
    respond_to do |format|
      if @brewery.update(brewery_params)
---
UPDATE "breweries" SET "active" = ?, "updated_at" = ? WHERE "breweries"."id" = 7  [["active", "t"], ["updated_at", "2015-02-22 15:59:34.986192"]]

  def destroy
    expire_brewery_fragments
    @brewery.destroy
---
DELETE FROM "breweries" WHERE "breweries"."id" = ?  [["id", 4]]

  def toggle_activity
        brewery = Brewery.find(params[:id])
        brewery.update_attribute :active, (not brewery.active)
---
SELECT  "breweries".* FROM "breweries"  WHERE "breweries"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "breweries" SET "active" = ?, "updated_at" = ? WHERE "breweries"."id" = 4  [["active", "t"], ["updated_at", "2015-02-22 19:48:51.134615"]]