app/controllers/ratings_controller.rb

INSERT INTO "ratings" ("beer_id", "created_at", "score", "updated_at") VALUES (?, ?, ?, ?)  [["beer_id", 1], ["created_at", "2015-02-22 18:34:03.431246"], ["score", 33], ["updated_at", "2015-02-22 18:34:03.431246"]]
---
  def create
    @rating = Rating.new params.require(:rating).permit(:score, :beer_id)

    if current_user.nil?
      redirect_to signin_path, notice:'you should be signed in'
    elsif @rating.save