app/controllers/styles_controller.rb

INSERT INTO "styles" ("created_at", "description", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2015-02-21 21:56:49.906252"], ["description", "se perus"], ["name", "Lager"], ["updated_at", "2015-02-21 21:56:49.906252"]]
---
  def create
    @style = Style.new(style_params)

    respond_to do |format|
      if @style.save

SELECT  "styles".* FROM "styles"  WHERE "styles"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_style
      @style = Style.find(params[:id])