app/controllers/users_controller.rb

  def index
    @users = User.includes(:beers, :ratings).all
---
SELECT "users".* FROM "users"

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "password_digest", "updated_at", "username") VALUES (?, ?, ?, ?)

  def toggle_disabled
      user = User.find(params[:id])
      user.update_attribute :disabled, (not user.disabled)
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "users" SET "disabled" = ?, "updated_at" = ? WHERE "users"."id" = 2  [["disabled", "t"], ["updated_at", "2015-02-22 21:14:12.565994"]]